app/views/evaluaciones/_form.html.erb

            <div class="col-md-12">
               <%= f.collection_select :estudiante_id, Estudiante.where(:jefe_id => @jefe.id), :id, :nombre1, :prompt => "Selecione Estudiante" %>
---
SELECT "estudiantes".* FROM "estudiantes" WHERE "estudiantes"."jefe_id" = 1