app/controllers/evaluaciones_controller.rb

  def new
    @evaluacion = Evaluacion.new
    @jefe = Jefe.find_by_cedula(current_user.username)
---
SELECT "jefes".* FROM "jefes" WHERE "jefes"."cedula" = '71706730' LIMIT 1

  def create
    @evaluacion = Evaluacion.new(evaluacion_params)
    @evaluacion.aspectos_positivos = params[:aspectos_positivos]
    @evaluacion.aspectos_positivos_ft = params[:aspectos_positivos_ft]
    #Recuperamos el jefe desde la tabla de "users" en @jefe
    @jefe = Jefe.find_by_cedula(current_user.username)
    #Recperamos el "id" del Jefe desde @jefe
    @evaluacion.jefe_id = @jefe.id
    if @evaluacion.save then
---
SELECT "jefes".* FROM "jefes" WHERE "jefes"."cedula" = '71706730' LIMIT 1
INSERT INTO "evaluaciones" ("administracionrecurso", "aspectos_positivos", "aspectos_positivos_ft", "created_at", "cumplimiento", "documentacionetapaproductiva", "estudiante_id", "fecha_evaluacion", "fecha_fin", "fecha_inicio", "fortalecimientoocupacional", "jefe_id", "juicio_evaluacion", "mejoracontinua", "observacion_aprendiz", "observacion_jefe", "oportunidadcalidad", "organizacion", "plan_mejoramiento", "rec_especial", "reconocimientos_especiales", "relacionesinterpersona", "responsabilidadambiental", "seguridadocupacionalindustrial", "solucionproblema", "trabajoequipo", "transferenciaconocimiento", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28) RETURNING "id"